import turtle


t = turtle.Pen()

def superJob():

    t.forward(150)
    t.left(150)
    t.forward(150)
    t.right(150)
    t.forward(50)

    t.forward(150)
    t.left(150)
    t.forward(150)
    t.right(150)
    t.forward(50)

    t.forward(150)
    t.left(150)
    t.forward(150)
    t.right(150)
    t.forward(50)

superJob()
   
# Вопросы:
#   1) есть ли в этой программе повторяющиеся куски кода? Если да, но найди и выдели их комментариями
#   2) когда выделишь эти повторяющиеся куски, засунь каждый кусок в отдельную процедуру.
#   3) сделай так, чтобы программа выдавала на экран то же самое, что показывает первая версия программы (т.е. рисунок зигзага)
#   P.S. для этого советую сделать копию данной программы, чтобы можно было сравнивать две версии программы (раннюю и новую)
